---
title: FormUtils
classe: Autodesk.Revit.DB.FormUtils
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# FormUtils

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean CanBeDissolved(Document, ICollection<ElementId>)` | `FormUtils.CanBeDissolved(ADoc, elements)` | Boolean |
| `ICollection<ElementId> DissolveForms(Document, ICollection<ElementId>)` | `FormUtils.DissolveForms(ADoc, elements)` | ICollection<ElementId> |
| `ICollection<ElementId> DissolveForms(Document, ICollection<ElementId>, ICollection<ElementId>&)` | `FormUtils.DissolveForms(ADoc, elements, ProfileOriginPointSet)` | ICollection<ElementId> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```